OpenFOAM-6-cantera-openmpi/tutorials/combustion/reactingFoam/RAS/DLR_A_LTS/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField  uniform 0.231843;

boundaryField
{
    inletfuel
    {
        type            fixedValue;
        value           uniform 0;
    }
    inletair
    {
        type            fixedValue;
        value           uniform 0.231843;
    }
        outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.231843;
        value           uniform 0.231843;
    }
    axis
    {
        type            empty;
    }
    leftside
    {
        type            zeroGradient;
    }
    burnerwall
    {
        type            zeroGradient;
    }
    burnertip
    {
        type            zeroGradient;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
